app/controllers/orders_controller.rb

SELECT "products".* FROM "products"
SELECT "products".* FROM "products" WHERE "products"."stripe_plan_name" IS NULL AND "products"."paypal_plan_name" IS NULL
---
    def index
      products = Product.all
      @products_purchase = products.where(stripe_plan_name:nil, paypal_plan_name:nil)

INSERT INTO "orders" ("product_id", "user_id", "payment_gateway", "price_cents") VALUES (?, ?, ?, ?)  [["product_id", 1], ["user_id", 2], ["payment_gateway", 0], ["price_cents", 3000]]
---
    def submit
      @order = nil
      #Check which type of order it is
      if order_params[:payment_gateway] == "stripe"
        prepare_new_order
        Orders::Stripe.execute(order: @order, user: current_user)
        exit
      elsif order_params[:payment_gateway] == "paypal"
        #PAYPAL WILL BE HANDLED HERE
      end
    ensure
      if @order&.save

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def prepare_new_order
      @order = Order.new(order_params)
      @order.user_id = current_user.id
      @product = Product.find(@order.product_id)